# --------------------------- Homework_3  ------------------------------------

"""

Виконала: Чорна Ольга
Homework_3

"""

from HW_Chorna.data_transform.model_evaluate import *
from HW_Chorna.data_extract.data_parse import *

if __name__ == '__main__':

    text, Model = yahoo_financial_data_interface()

    timeseries_model_analysis(Model, text)


'''
Аналіз отриманих результатів:

1. Вхідна вибірка:
дані за останні 100 днів по вартості Bitcoin/золота/йени в залежності від вибору користувача;

2. Визначені характеристики вхідної вибірки:
1. Bitcoin
Для апроксимації вартості Bitcoin рекомендовано обирати поліном не меньше 3 ступеня, 
це дозволяє отримати коефіціент детермінації більше за 0.874
Незважаючі на це не получаеться звести мат очікування помилки до 0.
Отримані статистичні характеристики помилки:
------------ Statistical characteristics -------------
Mean:  -259.20902415115415
Dispersion:  3004139.185490384
Standard deviation:  1733.2452756290393
-----------------------------------------------------
Необхідно розглянути апроксимацію вартості біткоїн нелінійною моделлю

2. Золото
Для апроксимації вартості золота рекомендовано обирати поліном не меньше 3 ступеня, 
це дозволяє отримати коефіціент детермінації більше за 0.70
Крім того ще стрибок коефіціента детермінації спостерігаеться на поліномі 5 ступеню - до 0.75
Апроксимація полномом адекватна, мат очікування помилки близьке до 0.
Отримані статистичні характеристики помилки:
------------ Statistical characteristics -------------
Mean:  0.2316012594062613
Dispersion:  497.50138537844714
Standard deviation:  22.30473907891431
-----------------------------------------------------

3. Японська йена
Для апроксимації курсаяпонської ейни до доллара рекомендовано обирати поліном не меньше 4 ступеня, 
це дозволяє отримати коефіціент детермінації більше за 0.83
Апроксимація полномом адекватна, мат очікування помилки близьке до 0.
Отримані статистичні характеристики помилки:
------------ Statistical characteristics -------------
Mean:  -0.02592329404100724
Dispersion:  1.4233881783778544
Standard deviation:  1.1930583298304631
-----------------------------------------------------

3. Висновок
Візуалізація побудованих трендів разом з вхідними даними демонструє адекватність розрахунків.
Оьтримані результати демонтсрують залежність коректного обрання моделі від предметної області.
У випадку Bitcoin необхідно розглянути нелінійну регресію,
а для апроксимації вартості золота та йени підходять поліноми вищих ступенів

'''