# --------------------------- Homework_3  ------------------------------------

"""

Виконала: Чорна Ольга
Homework_3

"""


from HW_Chorna.data_transform.model_evaluate import *
from HW_Chorna.data_extract.data_parse import *

if __name__ == '__main__':

    text, Model = oshadbank_financial_data_interface()

    timeseries_model_analysis(Model, text)


'''
Аналіз отриманих результатів - верифікація математичних моделей та результатів розрахунків.

1. Вхідна вибірка:
дані за період лютий 2023 - лютий 2024 по курсу валют гривня/долар;

2. Визначені характеристики вхідної вибірки:
Для всіх трьох показників - купівля, продаж, курс нбу використання мнк з поліномом другого ступеню є сумнівним.
Необхідне подальше дослідження.
Коефіцієнти детермінації трьох моделей знаходяться в межах (0.47, 0.57), що не характеризує мордель як підходящу

3. Висновок
Перенос зсуву математичного очікування вхідних даних в вільнй член 
квадратичного поліному після застосування мнк доводить адекватність розрахунків.
Зростання середньоквадратичного відхилення не спостерігається
Втім невідповідність тренда генерованої моделі та ступеня полінома оцінки впливають на точність моделі
Розроблений скрипт не рекомендується використовувати для визначення статистичних характеристик реальних даних.
Для оцінки реальних даних рекомендується покращити даний скрипт.

'''