# --------------------------- Homework_3  ------------------------------------

"""

Виконала: Чорна Ольга
Homework_3:
Закон зміни похибки – рівномірний, нормальний;
Закон зміни досліджуваного процесу (тренду) – кубічний, лінійний.
Комбінаторика похибка / тренд – довільна.
Реальні дані – 3 показники.
Очищення від аномалій - різні методи.
Опціональна екстраполяція присутня.
Сгладжування a-b, a-b-g фільтри.

"""

from HW_Chorna.data_transform.model_create import *
from HW_Chorna.data_transform.model_evaluate import *

if __name__ == '__main__':
    # Predefined parameters
    task_size = 10000
    random_error_generation_params = (0, 10)  # (low, high) in uniform case, (median, st-dev) in normal case

    Model = model_create_interface(task_size, *random_error_generation_params)

    timeseries_model_analysis(Model, 'Synthetic')

'''
Статистичні характеристики моделі даних після прибирання аномалій та прибирання тренду
наближені до характеристиск генерації, що підтверджує адекватність побудованих математичних моделей.

Методи очищення даних від викидів спроможні, верифіковані та адекватні.
Складність методів співставна, подальший вибір методу чищення від аномалій повинен залежати від предметної області.

Рекомендації по вибору ступеню полінома для апроксимації також спроможні.
Ступень рекомендованого для апроксимації полінома співпадає або наближаеться до 
ступеня полінома, обраного користувачем для генерації синтетичних даних.

'''
